---
type: BendingDetailCustomFieldProperties
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 29
tags: [revit-api, class]
---

# BendingDetailCustomFieldProperties

`Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties` · Revit 2024 · 29 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AreEqualTo | 2024 | `public virtual bool AreEqualTo ( ICustomFieldProperties otherProperties )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | AngularDimensionTextPosition | 2024 | `public BendingDetailDimensionTextPosition AngularDimensionTextPosition { get ; set ; }` |
| Property | AngularDimensionTypeId | 2024 | `public ElementId AngularDimensionTypeId { get ; set ; }` |
| Property | AngularDimensionsDisplayOption | 2024 | `public BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption { get ; set ; }` |
| Property | AngularDimensionsEnabled | 2024 | `public bool AngularDimensionsEnabled { get ; set ; }` |
| Property | AngularDimensionsForHooksEnabled | 2024 | `public bool AngularDimensionsForHooksEnabled { get ; set ; }` |
| Property | AngularDimensionsMeasurementOptions | 2024 | `public BendingDetailAngularDimensionsMeasurementOptions AngularDimensionsMeasurementOptions { get ; set ; }` |
| Property | AngularDimensionsOffset | 2024 | `public double AngularDimensionsOffset { get ; set ; }` |
| Property | BendDiameterDimensionType | 2024 | `public BendingDetailBendDiameterDimensionType BendDiameterDimensionType { get ; set ; }` |
| Property | BendDiameterDimensionsEnabled | 2024 | `public bool BendDiameterDimensionsEnabled { get ; set ; }` |
| Property | BendDiameterDimensionsForHooksEnabled | 2024 | `public bool BendDiameterDimensionsForHooksEnabled { get ; set ; }` |
| Property | BendDiameterDimensionsForSegmentsEnabled | 2024 | `public bool BendDiameterDimensionsForSegmentsEnabled { get ; set ; }` |
| Property | DiameterDimensionTypeId | 2024 | `public ElementId DiameterDimensionTypeId { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LineStyleId | 2024 | `public ElementId LineStyleId { get ; set ; }` |
| Property | MultipleValuesIndicatorOption | 2024 | `public BendingDetailCustomFieldMultipleValuesIndicatorOptions MultipleValuesIndicatorOption { get ; set ; }` |
| Property | OrthogonalAndOverallDimesionsEnabled | 2024 | `public bool OrthogonalAndOverallDimesionsEnabled { get ; set ; }` |
| Property | ParametersDisplayOption | 2024 | `public BendingDetailDisplayParametersOptions ParametersDisplayOption { get ; set ; }` |
| Property | RadialDimensionTypeId | 2024 | `public ElementId RadialDimensionTypeId { get ; set ; }` |
| Property | RepresentaionOf3DShapes | 2024 | `public BendingDetailFor3DShapesOptions RepresentaionOf3DShapes { get ; set ; }` |
| Property | SegmentLengthDimensionTextPosition | 2024 | `public BendingDetailDimensionTextPosition SegmentLengthDimensionTextPosition { get ; set ; }` |
| Property | SegmentLengthDimensionTypeId | 2024 | `public ElementId SegmentLengthDimensionTypeId { get ; set ; }` |
| Property | SegmentLengthDimensionsEnabled | 2024 | `public bool SegmentLengthDimensionsEnabled { get ; set ; }` |
| Property | SegmentLengthDimensionsForHooksEnabled | 2024 | `public bool SegmentLengthDimensionsForHooksEnabled { get ; set ; }` |
| Property | SegmentLengthDimensionsOffset | 2024 | `public double SegmentLengthDimensionsOffset { get ; set ; }` |
| Property | SegmentLengthsDisplayOption | 2024 | `public BendingDetailSegmentLengthsDisplayOptions SegmentLengthsDisplayOption { get ; set ; }` |
| Property | SegmentLengthsForArcsDisplayOption | 2024 | `public BendingDetailSegmentLengthsDisplayOptions SegmentLengthsForArcsDisplayOption { get ; set ; }` |
| Property | SegmentsRepresentation | 2024 | `public BendingDetailSegmentsRepresentation SegmentsRepresentation { get ; set ; }` |